/* No comment provided by engineer. */
"Address" = "العنوان";

/* No comment provided by engineer. */
"lang" = "ar";

/* No comment provided by engineer. */
"Basket" = "السلة";

/* No comment provided by engineer. */
"ChangeCity" = "تغيير المدينة";

/* No comment provided by engineer. */
"ChangePassword" = "تغيير كلمة المرور";

/* No comment provided by engineer. */
"Complaints" = "الشكاوي والإقتراحات";

/* This message is shown when complaints is empty */
"ComplaintsErrorMessage" = "من فضلك اكتب رسالة";

/* No comment provided by engineer. */
"ContactUs" = "تواصل معنا";

/* No comment provided by engineer. */
"CreateAccount" = "إنشاء حساب";

/* Error title */
"Error" = "خطأ";

/* No comment provided by engineer. */
"errorDecoding" = "errorDecoding";

/* First message in on boarding screen */
"FirsetMessage" = "إسفنجة بين يديط";

/* dialog information title */
"Information" = "معلومة";

/* No comment provided by engineer. */
"LogIn" = "تسجيل الدخول";

/* ok button */
"OK" = "حسنا";

/* No comment provided by engineer. */
"Profile" = "الصفحة الشحصية";

/* search page view */
"Search" = "البحث";

/* Second message in on boarding screen */
"SecondMessage" = "نصل إليك بضغطة واحدة";

/* No comment provided by engineer. */
"serverError" = "يرجى المحاولة في وقت لاحق";

/* Terms and conditions */
"TermsandConditions" = "الشروط والأحكام";

/* Third message in on boarding screen */
"ThirdMessage" = "بنقربلك مسافات بعيدة عنط";

/* No comment provided by engineer. */
"timeOut" = "انتهت مهلة الإتصال, حاول مجددا";

/* No comment provided by engineer. */
"unknownError" = "خطأ";

/* No comment provided by engineer. */
"VerifyNumber" = "تأكيد الرقم";

/* No comment provided by engineer. */
"Wallet" = "المحفظة";

/* No comment provided by engineer. */
"MinimumQuantity" = "أقل كمية ١";

/* No comment provided by engineer. */
"All" = "الكل";

/* No comment provided by engineer. */
"AccountActivatedSuccessfully" = "تم تفعيل الحساب بنجاح";

/* No comment provided by engineer. */
"Profileupdatedsuccessfully" = "تم تحديث الحساب بنجاح";

/* No comment provided by engineer. */
"ChangeLanguage" = "تغيير اللغة";

/* No comment provided by engineer. */
"Arabic" = "اللغة العربية";

/* No comment provided by engineer. */
"English" = "اللغة الإنجليزية";

/* No comment provided by engineer. */
"CANCEL" = "إلغاء";

/* No comment provided by engineer. */
"PasswordChangedSuccessfully" = "تم تغيير كلمة المرور بنجاح";

"resetPassword" = "إستعادو كلمة المرور";

/* No comment provided by engineer. */
"Addressisadded" = "تم إضافة العنوان";

/* No comment provided by engineer. */
"forgetPasswordLabel" = "اكتب رقم هاتفك وسوف نرسل لك كلمة مرور جديدة";

"phonePlaceholder" = "رقم الهاتف";

/* No comment provided by engineer. */
"Removephoto" = "حزف الصورة";

"productadd" = "تمت الإضافة";

/* No comment provided by engineer. */
"SelectfromAlbum" = "اختر من الألبوم";

/* No comment provided by engineer. */
"Takephoto" = "التقط صورة";

"AddedSuccessfully" = "تمت الإضافة بنجاح";

/* No comment provided by engineer. */
"Points" = "نقاط";

/** Validations*/

/* No comment provided by engineer. */
"requiredFields" = "جميع الحقول مطلوبة";

//User name
/* No comment provided by engineer. */
"requiredUsername" = "اسم المستخدم مطلوب";

/* No comment provided by engineer. */
"shortUsername" = "اسم المستخدم قصير للغاية";

/* No comment provided by engineer. */
"longUsername" = "اسم المستخدم طويل للغاية";

//Password
/* No comment provided by engineer. */
"requiredPassword" = "كلمة المرور مطلوبة";

/* No comment provided by engineer. */
"shortPassword" = "كلمة المرور يجب أن تكون أكبر من ٦ حروف";

//confirm Password

/* No comment provided by engineer. */
"requiredConfirmPassword" = "تأكيد كلمة المرور مطلوبة";

/* No comment provided by engineer. */
"passwordAndConfirmPasswordDoesNotMatch" = "كلمة المرور وتأكيد الكلمة غير متطابقتان";

/* No comment provided by engineer. */
"requiredPasswordAndItsConfirm" = "كلمة المرور وتأكيدها مطلوبتطان";


//Phone number

/* No comment provided by engineer. */
"requiredPhoneNumber" = "رقم الهاتف مطلوب";

/* No comment provided by engineer. */
"invalidPhoneNumber" = "رقم الهاتف غير صحيح";

/* No comment provided by engineer. */
"shortPhoneNumber" = "رقم الهاتف يجب أن يكون أكبر من ٧ أرقام";

/* No comment provided by engineer. */
"phoneIsDigitsOnly" = "رقم الهاتف يجب أن يحتوي على أرقام فقط";

/* No comment provided by engineer. */
"longtPhoneNumber" = "رقم الهاتف يجب أن يكون أقل من ١٥";


//Weak password

/* No comment provided by engineer. */
"weakPassword" = "كلمة المرور يجب أن تكون قوية";

//Email

/* No comment provided by engineer. */
"requiredEmail" = "البريد الإلكتروني مطلوب";

/* No comment provided by engineer. */
"invalidEmail" = "البريد الإلكتروني غير صحيح";

"open" = "مفتوح";

"Notifications" = "الإشعارات";

"close" = "مغلق";

"ChargeYourWallet" = "اشحن محفظتك";

"EnterChargeValue" = "ادخل قيمة الشحن";

"Charge" = "اشحن";

"CreditNotProvidedYet" = "الدفع الإلكتروني غير مدعوم بعد, قريبا";

"passwordResetSuccessfully" = "تم إرسال كلمة مرور جديدة إلى رقم هاتفك";

"OnlinePayment" = "الدفع الإلكتروني";

"Orders" = "الطلبات";

"OrderDetails" = "تفاصيل الطلب";

"Loading..." = "تحميل...";

//API Response
"SomethingWentWrong" = "حدث خطأ ما";
"NameIsRequired" = "اسم المستخدم مطلوب";
//                      "EmailIsRequiredAndInCorrectFormat"
//                      "PasswordIsRequiredOrMinimumLength"
"ConfirmPasswordIsMissingOrDoesNotMatch" = "";
//                      "PhoneIsRequiredAndInCorrectFormat"
"MobileExists" = "هذا الهاتف موجود";
//                      "EmailExists"
//                      "FailedToCreateUser"
//                      "FailedToUpload"
"WrongPhoneOrPassword" = "خطأ في اسم المستخدم أو كلمة المرور";
"AccountNotVerified" = "لم يتم تفعيل هذا الحساب";
"WrongVerificationCode" = "كود التفعيل غير صحيح";
"VerificationCodeDoesNotMatch" = "كود التفعيل غير صحيح";
"WrongPassword" = "خطأ في اسم المستخدم أو كلمة المرور";
"UserNotFound" = "السمتخدم غير موجود";
"MessageIsRequired" = "الرسالة مطلوبة";
"OrderDescriptionIsRequired" = "وصف الطلب مطلوب";
//                      "OrderCountryIsRequired"
//                      "OrderAreaIsRequired"
//                      "UserAddressIsRequired"
//                      "CountryNotFound"
//                      "CityNotFound"
//                      "UserAddressNotFound"
//                      "FloorIsRequired"
//                      "BuildingNumberIsRequired"
//                      "ApartmentIsRequired"
//                      "NoDriversAvailable"
//                      "OrderIdIsRequired"
//                      "OrderTypeIsRequired"
//                      "OrderNotFound"
//                      "DriverRejectedSuccesfullyButNoDriversAvailable"
//                      "DeliveryFeeIsRequired"
//                      "OrderPlacedSuccesfullyButNoDriversAvailable"
//                      "SubTotalIsRequired"
//                      "AmountPaidIsRequired"
//                      "CurrencyIsRequired"
//                      "OrderRejectedSuccesfullyButNoDriversAvailable"
//                      "DeliveryManNotFound"
//                      "ImageRequired"
//                      "WrongDeliveryMan"
//                      "PaymentMethodIsRequired"
"NotEnoughFund" = "لا يوجد رصيد كافي";
//                      "InvalidReferralCode"
"OrderAcceptedByAnotherDriver" = "هذا الطلب تم قبوله بواسطة سائق اخر";
//                      "UserDoesNotHaveOrders"
//                      "InvalidOperatingSystem"
//                      "InvalidPushToken"
//                      "LatitudeFieldIsRequired"
//                      "LongitudeFieldIsRequired"
//                      "CityFieldIsRequired"
//                      "LoginDataIsRequired"
//                      "RegisterDataIsRequired"
//                      "UserDoesNotHaveCity"
//                      "StoreNotFound"
//                      "UserNotAuthorized"
//                      "ProductNotFound"
//                      "StoreIsClosed"
//                      "SizeNotFound"
"OrderCannotBeFromMultipleStores" = "لا يمكن طلب نفس الطلب من أكثر من متجر";
//                      "BasketItemNotFound"
"CannotDecrease" = "لا يمكن إنقاص الكمية";
//                      "UserBasketIsEmpty"
//                      "StoreLocationIsNotDefined"
//                      "InvalidPaymentMethod"
//                      "InvalidStars"
"DriverNotFound" = "هذا السائق غير موجود";
//                      "DriverDoesNotHaveTheRequiredOrder"
//                      "UserAlreadyRated"
//                      "UserIsNotWorker"
//                      "CannotAcceptOrder"
//                      "DriverCoordinatesUnknown"
//                      "DriverReachedMaximumNumberOfAllowedOrders"
//                      "InvalidFinishCode"
//                      "WrongFacebookAccessToken"
//                      "UserRegisteredFromExternalSource"
//                      "AmountIsLowerThanMinimumAmountToBeCharged"
//                      "AmountIsHigherThanMaximumAmountToBeCharged"
//                      "JobNotFound"
//                      "WorkerNotFound"
//                      "UserIsBlocked"
//                      "PageMustBeGreaterThanZero"
//                      "QuntityNotAvilable"
//                      "YouAddOfferBefore"
//                      "CannotAcceptOfferOverThanMaxFees"
//                      "ItemIsAlreadyInFav"
//                      "ItemIsNotInFav"
//                      "EmptyFavs"
//                      "CategoryNotFound"
//                      "DriverAlreadyExist"
//                      "AccountAlreadyLogged"
//                      "CouponeDoesntExist"
//                      "PointsNotEnough"
//                      "PointsLessthanMinimum"
//                      "YouNotHavepoint"
//                      "QuntityMaximunPointNotAvilable"
